IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_dev_cfg_regs.xml
<module id="DEV_CFG_REGS" HW_revision="" description="DEV CFG Registers">
	<register id="DEVCFGLOCK1" width="32" page="1" offset="0x0" internal="0" description="Lock bit for DEVCFG registers">
		<bitfield id="CPUSEL0" description="Lock bit for CPUSEL0 register" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL1" description="Lock bit for CPUSEL1 register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL2" description="Lock bit for CPUSEL2 register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL4" description="Lock bit for CPUSEL4 register" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL5" description="Lock bit for CPUSEL5 register" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL6" description="Lock bit for CPUSEL6 register" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL7" description="Lock bit for CPUSEL7 register" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL8" description="Lock bit for CPUSEL8 register" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL9" description="Lock bit for CPUSEL9 register" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL11" description="Lock bit for CPUSEL11 register" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL12" description="Lock bit for CPUSEL12 register" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL14" description="Lock bit for CPUSEL14 register" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL15" description="Lock bit for CPUSEL15 register" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL16" description="Lock bit for CPUSEL16 register" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL18" description="Lock bit for CPUSEL18 register" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL25" description="Lock bit for CPUSEL25 register" begin="25" end="25" width="1" rwaccess="RW"/>
	</register>
	<register id="DEVCFGLOCK2" width="32" page="1" offset="0x2" internal="0" description="Lock bit for DEVCFG registers">
	</register>
	<register id="PARTIDL" width="32" page="1" offset="0x8" internal="0" description="Lower 32-bit of Device PART Identification Number">
		<bitfield id="QUAL" description="Qualification Status" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="PIN_COUNT" description="Device Pin Count" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="INSTASPIN" description="Motorware feature set" begin="14" end="13" width="2" rwaccess="RW"/>
		<bitfield id="FLASH_SIZE" description="Flash size in KB" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="PARTID_FORMAT_REVISION" description="Revision of the PARTID format" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="PARTIDH" width="32" page="1" offset="0xa" internal="0" description="Upper 32-bit of Device PART Identification Number">
		<bitfield id="FAMILY" description="Device family" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="PARTNO" description="Device part number" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="DEVICE_CLASS_ID" description="Device class ID" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="REVID" width="32" page="1" offset="0xc" internal="0" description="Device Revision Number">
		<bitfield id="REVID" description="Device Revision ID. This is specific to the Device" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="PERCNF1" width="32" page="1" offset="0x60" internal="0" description="Peripheral Configuration register">
		<bitfield id="ADC_A_MODE" description="ADC Wrapper-1 mode setting bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADC_B_MODE" description="ADC Wrapper-2 mode setting bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADC_C_MODE" description="ADC Wrapper-3 mode setting bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADC_D_MODE" description="ADC Wrapper-4 mode setting bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="USB_A_PHY" description="USB_A_PHY enable/disable bit" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="FUSEERR" width="32" page="1" offset="0x74" internal="0" description="e-Fuse error Status register">
		<bitfield id="ALERR" description="Efuse Autoload Error Status" begin="4" end="0" width="5" rwaccess="R"/>
		<bitfield id="ERR" description="Efuse Self Test Error Status" begin="5" end="5" width="1" rwaccess="R"/>
	</register>
	<register id="SOFTPRES0" width="32" page="1" offset="0x82" internal="0" description="Processing Block Software Reset register">
		<bitfield id="CPU1_CLA1" description="CPU1_CLA1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPU2_CLA1" description="CPU2_CLA1 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CPU1_CPUBGCRC" description="CPUBGCRC Module reset bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CPU1_CLA1BGCRC" description="CLA1BGCRC Module reset bit" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CPU2_CPUBGCRC" description="CPUBGCRC Module reset bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CPU2_CLA1BGCRC" description="CLA1BGCRC Module reset bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CPU1_ERAD" description="ERAD Module reset bit" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CPU2_ERAD" description="ERAD Module reset bit" begin="25" end="25" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES1" width="32" page="1" offset="0x84" internal="0" description="EMIF Software Reset register">
		<bitfield id="EMIF1" description="EMIF1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EMIF2" description="EMIF2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES2" width="32" page="1" offset="0x86" internal="0" description="Peripheral Software Reset register">
		<bitfield id="EPWM1" description="EPWM1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EPWM2" description="EPWM2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EPWM3" description="EPWM3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EPWM4" description="EPWM4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EPWM5" description="EPWM5 software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EPWM6" description="EPWM6 software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EPWM7" description="EPWM7 software reset bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EPWM8" description="EPWM8 software reset bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="EPWM9" description="EPWM9 software reset bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="EPWM10" description="EPWM10 software reset bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EPWM11" description="EPWM11 software reset bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="EPWM12" description="EPWM12 software reset bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="EPWM13" description="EPWM13 software reset bit" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="EPWM14" description="EPWM14 software reset bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="EPWM15" description="EPWM15 software reset bit" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="EPWM16" description="EPWM16 software reset bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
