IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_dev_cfg_regs.xml
	<register id="SOFTPRES3" width="32" page="1" offset="0x88" internal="0" description="Peripheral Software Reset register">
		<bitfield id="ECAP1" description="ECAP1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ECAP2" description="ECAP2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ECAP3" description="ECAP3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ECAP4" description="ECAP4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ECAP5" description="ECAP5 software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ECAP6" description="ECAP6 software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ECAP7" description="ECAP7 software reset bit" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES4" width="32" page="1" offset="0x8a" internal="0" description="Peripheral Software Reset register">
		<bitfield id="EQEP1" description="EQEP1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EQEP2" description="EQEP2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EQEP3" description="EQEP3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES6" width="32" page="1" offset="0x8e" internal="0" description="Peripheral Software Reset register">
		<bitfield id="SD1" description="SD1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SD2" description="SD2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES7" width="32" page="1" offset="0x90" internal="0" description="Peripheral Software Reset register">
		<bitfield id="SCI_A" description="SCI_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SCI_B" description="SCI_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SCI_C" description="SCI_C software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SCI_D" description="SCI_D software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES8" width="32" page="1" offset="0x92" internal="0" description="Peripheral Software Reset register">
		<bitfield id="SPI_A" description="SPI_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SPI_B" description="SPI_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SPI_C" description="SPI_C software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SPI_D" description="SPI_D software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES9" width="32" page="1" offset="0x94" internal="0" description="Peripheral Software Reset register">
		<bitfield id="I2C_A" description="I2C_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="I2C_B" description="I2C_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES10" width="32" page="1" offset="0x96" internal="0" description="Peripheral Software Reset register">
		<bitfield id="CAN_A" description="CAN_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CAN_B" description="CAN_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES11" width="32" page="1" offset="0x98" internal="0" description="Peripheral Software Reset register">
		<bitfield id="McBSP_A" description="McBSP_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="McBSP_B" description="McBSP_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="USB_A" description="USB_A software reset bit" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES13" width="32" page="1" offset="0x9c" internal="0" description="Peripheral Software Reset register">
		<bitfield id="ADC_A" description="ADC_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADC_B" description="ADC_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADC_C" description="ADC_C software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADC_D" description="ADC_D software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES14" width="32" page="1" offset="0x9e" internal="0" description="Peripheral Software Reset register">
		<bitfield id="CMPSS1" description="CMPSS1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2" description="CMPSS2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3" description="CMPSS3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4" description="CMPSS4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5" description="CMPSS5 software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6" description="CMPSS6 software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7" description="CMPSS7 software reset bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8" description="CMPSS8 software reset bit" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES16" width="32" page="1" offset="0xa2" internal="0" description="Peripheral Software Reset register">
		<bitfield id="DAC_A" description="Buffered_DAC12_1 software reset bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="DAC_B" description="Buffered_DAC12_2 software reset bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="DAC_C" description="Buffered_DAC12_3 software reset bit" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES17" width="32" page="1" offset="0xa4" internal="0" description="Reserved Peripheral Software Reset register">
		<bitfield id="CLB1" description="CLB1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLB2" description="CLB2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLB3" description="CLB3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLB4" description="CLB4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES18" width="32" page="1" offset="0xa6" internal="0" description="Reserved Peripheral Software Reset register">
		<bitfield id="FSITX_A" description="FSITX_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FSITX_B" description="FSITX_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_A" description="FSIRX_A software reset bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_B" description="FSIRX_B software reset bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_C" description="FSIRX_C software reset bit" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_D" description="FSIRX_D software reset bit" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_E" description="FSIRX_E software reset bit" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_F" description="FSIRX_F software reset bit" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_G" description="FSIRX_G software reset bit" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_H" description="FSIRX_H software reset bit" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES20" width="32" page="1" offset="0xaa" internal="0" description="Peripheral Software Reset register">
		<bitfield id="PMBUS_A" description="PMBUS_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
