IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_dev_cfg_regs.xml
	<register id="SOFTPRES21" width="32" page="1" offset="0xac" internal="0" description="Peripheral Software Reset register">
		<bitfield id="DCC0" description="DCC0 Module reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DCC1" description="DCC1 Module reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DCC2" description="DCC2 Module reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES23" width="32" page="1" offset="0xb0" internal="0" description="Peripheral Software Reset register">
		<bitfield id="ETHERCAT" description="ETHERCAT Module reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL0" width="32" page="1" offset="0xd6" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="EPWM1" description="EPWM1 CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EPWM2" description="EPWM2 CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EPWM3" description="EPWM3 CPU select bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EPWM4" description="EPWM4 CPU select bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EPWM5" description="EPWM5 CPU select bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EPWM6" description="EPWM6 CPU select bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EPWM7" description="EPWM7 CPU select bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EPWM8" description="EPWM8 CPU select bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="EPWM9" description="EPWM9 CPU select bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="EPWM10" description="EPWM10 CPU select bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EPWM11" description="EPWM11 CPU select bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="EPWM12" description="EPWM12 CPU select bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="EPWM13" description="EPWM13 CPU select bit" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="EPWM14" description="EPWM14 CPU select bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="EPWM15" description="EPWM15 CPU select bit" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="EPWM16" description="EPWM16 CPU select bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL1" width="32" page="1" offset="0xd8" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="ECAP1" description="ECAP1 CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ECAP2" description="ECAP2 CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ECAP3" description="ECAP3 CPU select bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ECAP4" description="ECAP4 CPU select bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ECAP5" description="ECAP5 CPU select bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ECAP6" description="ECAP6 CPU select bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ECAP7" description="ECAP7 CPU select bit" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL2" width="32" page="1" offset="0xda" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="EQEP1" description="EQEP1 CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EQEP2" description="EQEP2 CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EQEP3" description="EQEP3 CPU select bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL4" width="32" page="1" offset="0xde" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="SD1" description="SD1 CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SD2" description="SD2 CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL5" width="32" page="1" offset="0xe0" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="SCI_A" description="SCI_A CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SCI_B" description="SCI_B CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SCI_C" description="SCI_C CPU select bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SCI_D" description="SCI_D CPU select bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL6" width="32" page="1" offset="0xe2" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="SPI_A" description="SPI_A CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SPI_B" description="SPI_B CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SPI_C" description="SPI_C CPU select bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SPI_D" description="SPI_D CPU select bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL7" width="32" page="1" offset="0xe4" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="I2C_A" description="I2C_A CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="I2C_B" description="I2C_B CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL8" width="32" page="1" offset="0xe6" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="CAN_A" description="CAN_A CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CAN_B" description="CAN_B CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL9" width="32" page="1" offset="0xe8" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="McBSP_A" description="McBSP_A CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="McBSP_B" description="McBSP_B CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL11" width="32" page="1" offset="0xec" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="ADC_A" description="ADC_A CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADC_B" description="ADC_B CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADC_C" description="ADC_C CPU select bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADC_D" description="ADC_D CPU select bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL12" width="32" page="1" offset="0xee" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="CMPSS1" description="CMPSS1 CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2" description="CMPSS2 CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3" description="CMPSS3 CPU select bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4" description="CMPSS4 CPU select bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5" description="CMPSS5 CPU select bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6" description="CMPSS6 CPU select bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7" description="CMPSS7 CPU select bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8" description="CMPSS8 CPU select bit" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL14" width="32" page="1" offset="0xf2" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="DAC_A" description="Buffered_DAC12_1 CPU select bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="DAC_B" description="Buffered_DAC12_2 CPU select bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="DAC_C" description="Buffered_DAC12_3 CPU select bit" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL15" width="32" page="1" offset="0xf4" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="CLB1" description="CLB1 CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLB2" description="CLB2 CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLB3" description="CLB3 CPU select bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLB4" description="CLB4 CPU select bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
