IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_dev_cfg_regs.xml
	<register id="CPUSEL16" width="32" page="1" offset="0xf6" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="FSITX_A" description="FSITX_A CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FSITX_B" description="FSITX_B CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_A" description="FSIRX_A CPU select bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_B" description="FSIRX_B CPU select bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_C" description="FSIRX_C CPU select bit" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_D" description="FSIRX_D CPU select bit" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_E" description="FSIRX_E CPU select bit" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_F" description="FSIRX_F CPU select bit" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_G" description="FSIRX_G CPU select bit" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_H" description="FSIRX_H CPU select bit" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL18" width="32" page="1" offset="0xfa" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="PMBUS_A" description="PMBUS_A CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL25" width="32" page="1" offset="0x108" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="HRCAL" description="HRCAL CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CPU2RESCTL" width="32" page="1" offset="0x122" internal="0" description="CPU2 Reset Control Register">
		<bitfield id="RESET" description="CPU2 Reset Control bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key Qualifier for writes to this register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="RSTSTAT" width="16" page="1" offset="0x124" internal="0" description="Reset Status register for secondary C28x CPUs">
		<bitfield id="CPU2RES" description="CPU2 Reset Status bit" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CPU2NMIWDRST" description="Tells whether a CPU2.NMIWD reset was issued to CPU2 or not" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CPU2HWBISTRST" description="Tells whether a HWBIST reset was issued to CPU2 or not" begin="3" end="2" width="2" rwaccess="RW"/>
	</register>
	<register id="LPMSTAT" width="16" page="1" offset="0x125" internal="0" description="LPM Status Register for secondary C28x CPUs">
		<bitfield id="CPU2LPMSTAT" description="CPU2 LPM Status" begin="1" end="0" width="2" rwaccess="R"/>
	</register>
	<register id="BANKSEL" width="32" page="1" offset="0x184" internal="0" description="Configures the bank to programmed by CPU1.">
		<bitfield id="SEL" description="Selects the BANK to be programmed by CPU1 FMC." begin="1" end="0" width="2" rwaccess="RW"/>
	</register>
	<register id="USBTYPE" width="16" page="1" offset="0x19a" internal="0" description="Configures USB Type for the device">
		<bitfield id="TYPE" description="Configure USB type" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="LOCK" description="Lock bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ECAPTYPE" width="16" page="1" offset="0x19b" internal="0" description="Configures ECAP Type for the device">
		<bitfield id="TYPE" description="Configure ECAP type" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="LOCK" description="Lock bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="SDFMTYPE" width="16" page="1" offset="0x19c" internal="0" description="Configures SDFM Type for the device">
		<bitfield id="TYPE" description="Configure SDFM type" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="LOCK" description="Lock bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="MEMMAPTYPE" width="16" page="1" offset="0x19e" internal="0" description="Configures Memory Map Type for the device">
		<bitfield id="TYPE" description="Configures system specific features related to memory map." begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="LOCK" description="Lock bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
</module>
